Repository: pepr/progit2-cs
Catalog: omegat/tm/auto/progit-omegat-asciidoc.tmx
Source language: en
Languages: cs

source: To install Git, you need to have the following libraries that Git depends on: curl, zlib, openssl, expat, and libiconv.
cs: Před instalací samotného Gitu musí váš systém obsahovat následující knihovny, na nichž je Git závislý: curl, zlib, openssl, expat, a libiconv.

source: To merge this work into your current working branch, you can run `git merge origin/serverfix`.
cs: Chcete-li začlenit tato data do své aktuální pracovní větve, spusťte příkaz `git merge origin/serverfix`.

source: To modify a commit that is farther back in your history, you must move to more complex tools.
cs: Chcete-li změnit revizi, která leží hlouběji ve vaší historii, budete muset sáhnout po složitějších nástrojích.

source: To move the tags to be proper Git tags, run
cs: Abyste značky upravili na korektní gitové značky, spusťte

source: To obtain commits made at a specific instant in time (e.g. 29 April 2013 at 17:07:22 CET), we can use
cs: Pokud chceme získat zápisy z určitého časového okamžiku (například z 29. dubna 2013 v 17:07:22 středoevropského času), můžeme použít příkaz

source: To phrase that another way, when you try to merge one commit with a commit that can be reached by following the first commit’s history, Git simplifies things by moving the pointer forward because there is no divergent work to merge together — this is called a "fast forward".
cs: Jinými slovy: pokud se pokoušíte sloučit jednu revizi s revizí druhou, k níž lze dospět následováním historie první revize, Git proces zjednoduší a přesune ukazatel vpřed, protože neexistuje žádná rozdílná práce, kterou by bylo třeba sloučit. Tomuto postupu se říká „rychle vpřed“.

source: To prevent SSH from refusing to work, type this:
cs: Aby SSH neodmítl pracovat, napište následující:

source: To pull in the changes and prepopulate the commit message, use the `--squash` and `--no-commit` options as well as the `-s subtree` strategy option:
cs: Chcete-li natáhnout změny a předběžně vyplnit zprávu k revizi, použijte parametry `--squash`, `--no-commit` a také parametr strategie `-s subtree`:

source: To pull the `master` branch on the remote down to `origin/mymaster` locally, you can run
cs: Chcete-li stáhnout větev `master` ze vzdáleného serveru do lokálního adresáře `origin/mymaster`, můžete zadat příkaz:

source: To push a new stash onto your stack, run `git stash`:
cs: Chcete-li do zásobníku odeslat nový odklad, spusťte příkaz `git stash`:

source: To push to a Subversion server, you run the `git svn dcommit` command:
cs: Pro odeslání revizí na server Subversion zadejte příkaz `git svn dcommit`:

source: To quickly demonstrate, you’ll write a simple importer.
cs: Jako rychlou ukázku napíšeme jednoduchý importér.

source: To really understand the way Git does branching, we need to take a step back and examine how Git stores its data.
cs: Abychom skutečně pochopili, jak funguje v systému Git větvení, budeme se muset vrátit o krok zpět a podívat se, jak Git ukládá data.

source: To remove a file from Git, you have to remove it from your tracked files (more accurately, remove it from your staging area) and then commit.
cs: Chcete-li odstranit soubor ze systému Git, musíte ho odstranit ze sledovaných souborů (přesněji řečeno odstranit z oblasti připravených změn) a zapsat revizi.

source: To remove a file named passwords.txt from your entire history, you can use the `--tree-filter` option to `filter-branch`:
cs: Pro odstranění souboru s názvem passwords.txt z celé historie můžete použít parametr `--tree-filter`, který přidáte k příkazu `filter-branch`:

source: To remove it, you can run `git stash drop` with the name of the stash to remove:
cs: Chcete-li ji odstranit, spusťte příkaz `git stash drop` s názvem odkladu, který má být odstraněn:

source: To remove remote branches, you must remove the ref files from the server manually.
cs: Budete-li chtít odstranit vzdálenou větev, budete muset ručně smazat referenční soubory ze serveru.

source: To resolve this situation, you can run `git svn rebase`, which pulls down any changes on the server that you don’t have yet and rebases any work you have on top of what is on the server:
cs: Chcete-li tuto situaci vyřešit, spusťte příkaz `git svn rebase`, jímž stáhnete veškeré změny na serveru, které ještě nemáte lokálně, a přeskládáte všechnu práci na vrchol toho, co se nachází na serveru:

source: To run `filter-branch` on all your branches, you can pass `--all` to the command.
cs: Chcete-li spustit příkaz `filter-branch` na všech větvích, zadejte k příkazu parametr `--all`.

source: To run the importer, pipe this output through `git fast-import` while in the Git repository you want to import into.
cs: Pro spuštění importéru přesměrujte tento výstup do příkazu `git fast-import`. Příkaz spouštějte v adresáři Gitu, do nějž chcete data importovat.

source: To see a full diff of what would happen if you were to merge this topic branch with another branch, you may have to use a weird trick to get the correct results.
cs: Chcete-li vidět plný výpis diff, jak by vypadaly rozdíly, kdybyste tuto tematickou větev začlenili do jiné větve, můžete použít speciální trik, který vám zobrazí požadované informace.

source: To see all the branches that contain work you haven’t yet merged in, you can run `git branch --no-merged`:
cs: Chcete-li zobrazit větve, které obsahují dosud nezačleněnou práci, spusťte příkaz `git branch --no-merged`:

source: To see an up-to-date list, check out the following page:
cs: Aktuální seznam těchto míst najdete na následující stránce:

source: To see reflog information formatted like the `git log` output, you can run `git log -g`:
cs: Chcete-li zobrazit informace záznamu reflog ve formátu výstupu `git log`, zadejte příkaz `git log -g`:

source: To see the diff of what you’ve staged, you can use the `6` or `d` (for diff) command.
cs: Chcete-li zobrazit výpis diff připravených souborů, použijte příkaz `6` nebo `d` (jako „diff“).

source: To see the last commit on each branch, you can run `git branch -v`:
cs: Chcete-li zobrazit poslední revizi na každé větvi, spusťte příkaz `git branch -v`:

source: To see the same information in a much more useful way, we can run `git log -g`, which will give you a normal log output for your reflog.
cs: Chcete-li zobrazit stejné informace v užitečnějším formátu, můžete spustit příkaz `git log -g`, jímž získáte normální výstup příkazu log pro reflog.

source: To see what changes each commit introduces, remember that you can pass the `-p` option to `git log` and it will append the diff introduced to each commit.
cs: Chcete-li zjistit, jaké změny byly v jednotlivých revizích provedeny, můžete k příkazu `git log` přidat parametr `-p`, který ke každé revizi připojí rozdíly ve formátu diff.

source: To see what happens, you can manually ask Git to pack up the objects by calling the `git gc` command:
cs: Chcete-li vidět, jak proces probíhá, můžete systému Git ručně zadat, aby objekty zabalil. Zadejte příkaz `git gc`:

source: To see what packfiles are available on this server, you need to get the `objects/info/packs` file, which contains a listing of them (also generated by `update-server-info`):
cs: Chcete-li zjistit, jaké balíčkové soubory jsou na serveru dostupné, pomůže vám soubor `objects/info/packs`, který obsahuje jejich seznam (rovněž generován příkazem `update-server-info`):

source: To see what you’ve changed but not yet staged, type `git diff` with no other arguments:
cs: Chcete-li vidět, co jste změnili, avšak ještě nepřipravili k zapsání, zadejte příkaz `git diff` bez dalších parametrů:

source: To see which branches are already merged into the branch you’re on, you can run `git branch --merged`:
cs: Chcete-li zjistit, které větve už byly začleněny do větve, na níž se nacházíte, spusťte příkaz `git branch --merged`:

source: To see which remote servers you have configured, you can run the `git remote` command.
cs: Chcete-li zjistit, jaké vzdálené servery máte nakonfigurovány, můžete použít příkaz `git remote`.

source: To see which stashes you’ve stored, you can use `git stash list`:
cs: Chcete-li se podívat, které soubory jste odložili, spusťte příkaz `git stash list`:

source: To set up a local branch with a different name than the remote branch, you can easily use the first version with a different local branch name:
cs: Chcete-li nastavit lokální větev s jiným názvem, než má vzdálená větev, můžete jednoduše použít první variantu s odlišným názvem lokální větve:

source: To set up your client, you must export the P4PORT environment variable to point to the Perforce depot:
cs: K nastavení svého klienta budete muset exportovat proměnnou prostředí P4PORT, která bude ukazovat na depot Perforce:

source: To stage it, you run the `git add` command (it’s a multipurpose command — you use it to begin tracking new files, to stage files, and to do other things like marking merge-conflicted files as resolved).
cs: Chcete-li ho připravit k zapsání, spusťte příkaz `git add` (jedná se o víceúčelový příkaz – používá se k zahájení sledování nových souborů i k dalším operacím, jako je například označení vyřešených případů kolize souborů při slučování).

source: To stage the TODO and index.html files, you can type the numbers:
cs: Jestliže chcete připravit k zapsání soubory TODO a index.html, zadejte příslušná čísla:

source: To start `instaweb` with a non-lighttpd handler, you can run it with the `--httpd` option.
cs: Chcete-li spustit `instaweb` s jiným správcem než `lighttpd`, použijte parametr `--httpd`:

source: To stay out of trouble, try to follow these guidelines:
cs: Chcete-li se vyhnout problémům, dodržujte tato pravidla:

source: To switch to an existing branch, you run the `git checkout` command.
cs: Chcete-li přepnout na existující větev, spusťte příkaz `git checkout`.

source: To synchronize your work, you run a `git fetch origin` command.
cs: K synchronizaci své práce použijte příkaz `git fetch origin`.

source: To tag that commit, you specify the commit checksum (or part of it) at the end of the command:
cs: Pro označení revize značkou zadejte na konec příkazu kontrolní součet revize (nebo jeho část):

source: To tell Git to treat all `pbxproj` files as binary data, add the following line to your `.gitattributes` file:
cs: Chcete-li systému Git zadat, aby nakládal se všemi soubory `pbxproj` jako s binárními daty, vložte do souboru `.gitattributes` následující řádek:

source: To tell Git to use it as the default message that appears in your editor when you run `git commit`, set the `commit.template` configuration value:
cs: Chcete-li systému Git zadat, aby soubor používal jako výchozí zprávu, která se zobrazí v textovém editoru po spuštění příkazu `git commit`, nastavte konfigurační hodnotu `commit.template`:

source: To upload data to a remote process, Git uses the `send-pack` and `receive-pack` processes.
cs: K uploadu dat do vzdáleného procesu používá Git procesy `send-pack` a `receive-pack`.

source: To use this, specify `git-shell` instead of bash or csh for your user’s login shell.
cs: Chcete-li nástroj použít, zadejte pro přihlašovací shell vašeho uživatele `git-shell` místo bash nebo csh.

source: To verify a signed tag, you use `git tag -v [tag-name]`.
cs: Chcete-li ověřit podepsanou značku, použijte příkaz `git tag -v [název značky]`.

source: To visualize this, let’s assume that you have a directory containing three files, and you stage them all and commit.
cs: Pro ilustraci předpokládejme, že máte adresář se třemi soubory, které připravíte k zapsání a následně zapíšete.

source: Topic branches, however, are useful in projects of any size.
cs: Naproti tomu tematické větve se vám budou hodit v projektech jakékoli velikosti.

source: Tracking branches are local branches that have a direct relationship to a remote branch.
cs: Sledující větve jsou lokální větve s přímým vztahem ke vzdálené větvi.

source: Type
cs: Zadejme tedy:

source: Type the name of the tool you’d rather use.
cs: Zadejte název nástroje, který chcete použít.

source: Typing `?` shows a list of what you can do:
cs: Zadáte-li znak `?`, zobrazí se seznam možností, které máte k dispozici.

source: Understanding and mastering this feature gives you a powerful and unique tool and can literally change the way that you develop.
cs: Pokud tuto funkci pochopíte a zvládnete její ovládání, dostanete do ruky výkonný a unikátní nástroj, který doslova změní váš pohled na vývoj.

source: Understanding how Git works at a lower level should make it easier to understand why it’s doing what it’s doing and also to write your own tools and helping scripts to make your specific workflow work for you.
cs: Poznání, jak Git pracuje na nižší úrovni, by vám mělo pomoci pochopit, proč dělá to, co dělá, a zároveň by vám mělo umožnit napsat vlastní nástroje a podpůrné skripty, pomocí nichž budete moci automatizovat zvolený pracovní postup.

source: Unfortunately, there’s no good way to avoid this situation — Subversion can’t store this information, so you’ll always be crippled by its limitations while you’re using it as your server.
cs: Bohužel však neexistuje žádný dobrý způsob, jak této situaci předejít, Subversion nedokáže tyto informace uchovávat. Dokud tedy budete používat server Subversion, vždy se budete muset s tímto jeho nedostatkem vyrovnat.

source: Unfortunately, very few binary formats can be represented as human readable text (imagine trying to convert audio data to a text).
cs: Naneštěstí existuje jen velmi málo binárních formátů, které lze převést na lidsky čitelný text.

source: Unlike Centralized Version Control Systems (CVCSs), the distributed nature of Git allows you to be far more flexible in how developers collaborate on projects.
cs: Na rozdíl od centralizovaných systémů správy verzí (CVCS) umožňuje distribuovaný charakter systému Git mnohem větší flexibilitu při spolupráci vývojářů na projektech.

source: Unlike many other VCS systems, Git doesn’t explicitly track file movement.
cs: Na rozdíl od ostatních systémů pro správu verzí nesleduje Git explicitně přesouvání souborů.

source: Unlike many other VCSs, Git encourages a workflow that branches and merges often, even multiple times in a day.
cs: Na rozdíl od ostatních systémů pro správu verzí vybízí Git ke způsobu práce s bohatým větvením a častým slučováním, a to i několikrát za den.

source: Untracked basically means that Git sees a file you didn’t have in the previous snapshot (commit); Git won’t start including it in your commit snapshots until you explicitly tell it to do so.
cs: Není-li soubor sledován, obecně to znamená, že Git ví o souboru, který nebyl v předchozím snímku (v předchozí revizi), a nezařadí ho ani do dalších snímků, dokud mu k tomu nedáte výslovný příkaz.

source: Users who are migrating from the older Gitolite should note that there is a significant change in behaviour with regard to this feature; please see the migration guide for details.
cs: Uživatelé, kteří přecházejí ze starší verze Gitolite by si měli dát pozor na to, že v souvislosti s uvedeným rysem došlo k výrazné změně chování. Věnujte prosím pozornost detailům, které jsou uvedeny v příručce pro přechod k nové verzi.

source: Using a VCS also means that if you screw things up or lose files, you can generally recover easily.
cs: Používáte-li verzovací systém, většinou to také znamená, že snadno obnovíte soubory, které jste ztratili nebo v nichž byly provedeny nežádoucí změny.

source: Using attributes, you can do things like specify separate merge strategies for individual files or directories in your project, tell Git how to diff non-text files, or have Git filter content before you check it into or out of Git.
cs: Pomocí atributů lze například určit odlišnou strategii slučování pro konkrétní soubory nebo adresáře projektu, zadat systému Git nástroj diff pro netextové soubory nebo jak filtrovat obsah před načtením dat do systému Git nebo jejich odesláním.

source: Using smart protocols is a more common method of transferring data.
cs: Rozšířenější metodou přenosu dat je použití chytrého protokolu.

source: Using submodules isn’t without hiccups, however.
cs: Používání submodulů se však vždy neobejde bez zádrhelů.

source: Usually, you can’t immediately switch every project you come in contact with to Git.
cs: Většinou není možné okamžitě přepnout každý projekt, s nímž přijdete do styku, na systém Git.

source: Various integration managers are in charge of certain parts of the repository; they’re called lieutenants.
cs: Několik různých integračních manažerů odpovídá za konkrétní části repozitáře – říká se jím poručíci (lieutenants).

source: Version control is a system that records changes to a file or set of files over time so that you can recall specific versions later.
cs: Správa verzí je systém, který zaznamenává změny souboru nebo sady souborů tak, abyste se mohli později k určité verzi vrátit.

source: We also assume you’re running a standard Linux distribution like Ubuntu.
cs: Předpokládáme také, že pracujete se standardní linuxovou distribucí, jako je např. Ubuntu.

source: We assume that if you have a server with which to do this, you already have an SSH server installed, and that’s how you’re accessing the server.
cs: Předpokládáme, že pokud máte server, na němž to lze provést, máte už nainstalován server SSH a jeho prostřednictvím k serveru přistupujete.

source: We can demonstrate by aliasing `git visual` to run `gitk`:
cs: Jako příklad můžeme uvést situaci, kdy nahradíte příkaz `git visual` aliasem `gitk`:

source: We covered how to generate a new key earlier, in the "Simple Setups" section.
cs: Jak vygenerovat nový klíč, jsme popsali výše, v části 4.3.

source: We will begin by explaining some background on version control tools, then move on to how to get Git running on your system and finally how to get it set up to start working with.
cs: Nejdříve si vysvětlíme něco z historie nástrojů pro správu verzí, poté se budeme věnovat tomu, jak spustit systém Git ve vašem počítači, a nakonec se podíváme na to, co musíme nastavit, abychom s ním mohli začít pracovat.

source: We will describe the simplest install method in this article; for the other methods please see the documentation.
cs: Teď si popíšeme nejjednodušší způsob instalace. V dokumentaci naleznete další metody.

source: We'll make use of the both described approaches to get usable diffs for some widely used binary formats.
cs: Oba popsané přístupy k získání použitelných informací o rozdílech si ukážeme na některých běžně používaných binárních formátech.

source: Well, doing so creates a new pointer for you to move around.
cs: Ano, nová větev znamená vytvoření nového ukazatele, s nímž můžete pohybovat.

source: Well, let’s do another commit:
cs: Dobře, proveďme další revizi:

source: We’ll also show you how to set up Git to ignore certain files and file patterns, how to undo mistakes quickly and easily, how to browse the history of your project and view changes between commits, and how to push and pull from remote repositories.
cs: Ukážeme si také, jak nastavit Git, aby ignoroval určité soubory a masky souborů, jak rychle a jednoduše vrátit nežádoucí změny, jak procházet historii projektu a zobrazit změny mezi jednotlivými revizemi a jak posílat soubory do vzdálených repozitářů a naopak z nich soubory zase stahovat.

source: We’ll cover `git diff` in more detail later; but you’ll probably use it most often to answer these two questions: What have you changed but not yet staged?
cs: Podrobněji se budeme příkazu `git diff` věnovat později. Vy ho však nejspíš budete nejčastěji využívat k zodpovězení těchto dvou otázek: Co jste změnili, ale ještě nepřipravili k zapsání?

source: We’ll cover this distinction a bit more in _Chapter 5_.
cs: K tomuto rozlišení se blíže dostaneme v _kapitole 5_.

source: We’ll discuss how to export a bare repository copy for this purpose in the next section, “Getting Git on a Server.”
cs: O exportu kopie holého repozitáře pro tento účel se více dočtete v následující části „Jak umístit Git na server“.

source: We’ll explore some of the benefits you gain by thinking of your data this way when we cover Git branching in Chapter 3.
cs: Některé přednosti, které tato metoda správy dat nabízí, si podrobně ukážeme na systému větvení v kapitole 3.

source: We’ll go over what these commands do in just a minute.
cs: K tomu, co přesně tyto příkazy provedou, se dostaneme za okamžik.

source: We’ll need to write a script to extract the content and return it as plain text.
cs: Potřebujeme napsat skript, který by extrahoval obsah a vrátil jej jako prostý text.

source: We’ll quickly go over how that is done.
cs: A právě u účtů se teď na chvíli zastavíme.

source: We’ll refer to this repository as a "Git server"; but you’ll notice that it generally takes a tiny amount of resources to host a Git repository, so you’ll rarely need to use an entire server for it.
cs: Tomuto repozitáři budeme říkat „gitový server“. Jak ale zjistíte, nebývá hostování gitového repozitáře nijak zvlášť náročné na zdroje, a tak nejspíš nebudete potřebovat celý server.

source: We’ll round off this discussion with a sampling of other features, all of which, and many more, are described in great detail in the documentation.
cs: Vysvětlení Gitolite završíme přehledem několika vlastností, které jsou detailně popsány v dokumentaci.

source: We’ll use the normal path here because doing so is almost always faster.
cs: My budeme používat normální cestu, neboť tato metoda je téměř vždy rychlejší.

source: We’ll walk though installing GitWeb manually very quickly.
cs: Ruční instalaci skriptu probereme velmi rychle.

source: We’ve covered basic branching and merging in Git.
cs: V této kapitole jsme se věnovali základům větvení a slučování.

source: What does that mean?
cs: A co to znamená?

source: What does this `post-update` hook do?
cs: Jaká je funkce zásuvného modulu `post-update`?

source: What gets interesting is that you can fairly easily merge changes from one of the branches to the other.
cs: Je zajímavé, že tak lze opravdu jednoduše začlenit změny z jedné větve do druhé.

source: What happens if you create a new branch?
cs: Co se stane, když vytvoříte novou větev?

source: What if you realize that you don’t want to keep your changes to the `benchmarks.rb` file?
cs: A co když zjistíte, že nechcete zachovat změny, které jste provedli v souboru `benchmarks.rb`?

source: What if you want anonymous read access to your project?
cs: A co když chcete u svého projektu nastavit anonymní oprávnění pro čtení?

source: What is also interesting is that the second version of the file is the one that is stored intact, whereas the original version is stored as a delta — this is because you’re most likely to need faster access to the most recent version of the file.
cs: Za povšimnutí dále stojí, že byla v plné velikosti ponechána druhá verze souboru, původní verze byla uložena ve formě rozdílů. Je to z toho důvodu, že rychlejší přístup budete pravděpodobně potřebovat spíš k aktuálnější verzi souboru.

source: What is cool is that although the objects on disk before you ran the `gc` were collectively about 8K in size, the new packfile is only 4K.
cs: Hlavní předností balíčkového souboru je jeho velikost. Přestože objekty na disku zabíraly před spuštěním příkazu `gc` celkem asi 8 kB, nový soubor má pouze 4 kB.

source: What is the "word" filter?
cs: Co je to filtr „word“?

source: What is the significance of that?
cs: A jaký to má smysl?

source: What is version control, and why should you care?
cs: Co je to správa verzí a proč by vás měla zajímat?

source: What the heck?
cs: Co to má být?

source: What then?
cs: Co teď?

source: What used to be referenced at `pb/master` is now at `paul/master`.
cs: Z původní reference `pb/master` se tak nyní stává `paul/master`.
